GabyGold67/SevenSegDisplays_STM32/src/sevenSegDisplays.h
/**
 * @file		: SevenSegDisplays.h
 * @brief	: Header file for SevenSegDisplays library classes
 *
 * @author	: Gabriel D. Goldman
 * @date		: Created on: Nov 16, 2023
 */
#ifndef _SEVENSEGDISPLAYS_STM32_H_
#define _SEVENSEGDISPLAYS_STM32_H_

#include "SevenSegDispHw.h"

#include <stdint.h>
#include <string>
#include <stdio.h>
#include <cstring>	//Eliminate by replacing the use of strcpy and strcat
//===========================>> Next lines included for developing purposes, corresponding headers must be provided for the production platform/s
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
//===========================>> Previous lines included for developing purposes, corresponding headers must be provided for the production platform/s

//===========================>> Next lines used to avoid CMSIS wrappers
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
//#include "queue.h"
//#include "semphr.h"
//#include "event_groups.h"
//===========================>> Previous lines used to avoid CMSIS wrappers

const int MAX_DIGITS_PER_DISPLAY{8};
const int MAX_DISPLAYS_QTY{10};

//============================================================> Class declarations separator

/**
 * @brief Implements a seven segment display object
 *
 * @class SevenSegDisplays
 */
class SevenSegDisplays {
    static uint8_t _displaysCount;
    static uint16_t _dspSerialNum;
    static uint8_t _dspPtrArrLngth;
    static SevenSegDisplays** _instancesLstPtr;

    static TimerHandle_t _blinkTmrHndl;
    static TimerHandle_t _waitTmrHndl;

    static void tmrCbBlink(TimerHandle_t blinkTmrCbArg);
    static void tmrCbWait(TimerHandle_t waitTmrCbArg);
private:
    uint8_t _waitChar {0xBF};
    uint8_t _waitCount {0};
    bool _waiting {false};
    unsigned long _waitRate {250};
    unsigned long _waitTimer {0};
protected:
    const unsigned long _minBlinkRate{100};
    const unsigned long _maxBlinkRate{2000};

    bool* _blinkMaskPtr{nullptr};
    uint8_t* _dspAuxBuffPtr{nullptr};
    bool _dspBuffChng{false};
    uint8_t* _dspBuffPtr{nullptr};
    uint8_t _dspDigitsQty{};
    SevenSegDispHw _dspUndrlHw{};
    SevenSegDisplays* _dspInstance;
    uint16_t _dspInstNbr{0};
    int32_t _dspValMax{};
    int32_t _dspValMin{};
    bool _blinking{false};
    bool _blinkShowOn{false};
    unsigned long _blinkTimer{0};
    unsigned long _blinkOffRate{500};
    unsigned long _blinkOnRate{500};
    unsigned long _blinkRatesGCD{500};  //Holds the value for the minimum timer checking the change ON/OFF of the blinking,
                                        //saving unneeded timer interruptions, and without the need of the std::gcd function
    std::string _charSet{"0123456789AabCcdEeFGHhIiJLlnOoPqrStUuY-_=~* ."}; // for using indexOf() method
    uint8_t _charLeds[45] = {   //Values valid for a Common Anode display. For a Common Cathode display values must be logically bit negated
        0xC0, // 0
        0xF9, // 1
        0xA4, // 2
        0xB0, // 3
        0x99, // 4
        0x92, // 5
        0x82, // 6
        0xF8, // 7
        0x80, // 8
        0x90, // 9
        0x88, // A
        0xA0, // a
        0x83, // b
        0xC6, // C
        0xA7, // c
        0xA1, // d
        0x86, // E
        0x84, // e
        0x8E, // F
        0xC2, // G
        0x89, // H
        0x8B, // h
        0xF9, // I
        0xFB, // i
        0xF1, // J
        0xC7, // L
        0xCF, // l
        0xAB, // n
        0xC0, // O
        0xA3, // o
        0x8C, // P
        0x98, // q
        0xAF, // r
        0x92, // S
        0x87, // t
        0xC1, // U
        0xE3, // u
        0x91, // Y
        0xBF, // Minus -
        0xF7, // Underscore _
        0xB7, // Low =
        0xB6, //~ for Equivalent symbol
        0x9C, // °
        0xFF, // Space
        0x7F  //.
    };

    uint8_t _space {0xFF};
    uint8_t _dot {0x7F};
    std::string _zeroPadding{""};
    std::string _spacePadding{""};

    unsigned long blinkTmrGCD(unsigned long blnkOnTm, unsigned long blnkOffTm);
    void restoreDspBuff();
    void saveDspBuff();
    void setAttrbts();
    void updBlinkState();
    void updWaitState();

public:
    /**
     * @brief Default class constructor
     *
     */
    SevenSegDisplays();
    /**
     * @brief Class constructor
     *
     * @param dspUndrlHw Underlying hardware display.
     *
     *  Is the physical device used to display the information generated by this object, and is kept in it's buffer.
     *  As such it has physical properties that might condition some of this object characteristics -some has no practical incidence- including:
     *  - Digits (ports) quantity.
     *  - Type of led connection (common Anode/common Cathode).
     *  - Quantity and position of semicolons.
     *  - Managed brightness levels.
     *  - Display color change.
     *
     */
    SevenSegDisplays(SevenSegDispHw dspUndrlHw);
    /**
     * @brief Virtual class destructor
     *
     */
    ~SevenSegDisplays();
    /**
     * @brief Makes the display blink the contents it is showing.
     *
     * The display blinks until a noBlink() method is invoked. The display will continue blinking even if the contents are changed. By default all the digits blink, but each digit might be configured individually to blink or not by using the setBlinkMask(const bool*) method. When invoking this method with no parameters the existing blinking times parameters -stating the time the blinking ports will stay off an then the time they will stay on-. The blinking times are set at instantiation time to generate a symmetrical blinking effect, meaning that the time the display shows the contents and the time the display is blank are equal. The blinking rate can be changed by using the setBlinkRate(const unsigned long, const unsigned long) method. After changing the blinking rate, the new blinking rate will be kept after a noBlink() or a new blink() without parameters call is done, until it is modified with a new setBlinkRate(const unsigned long, const unsigned long) call, or it is restarted by a blink(const unsigned long, const unsigned long) with parameters. Note that to restart the blinking with a blink() the service must first be stopped, as the method call makes no changes if the blinking service was already running.
     *
     * @retval true: If the display was not already set to blink (so now the blinking starts).
     * @retval false: The display was already set to blink.
     */
    bool blink();
    /**
     * @brief Makes the display blink the contents it is showing using the timing set by the parameters.
     *
     * @param onRate Time (in milliseconds) the display must stay on, the value must be in the range minBlinkRate <= onRate <= maxBlinkRate. Those preset values can be known by the use of the getMinBlinkRate() and the getMaxBlinkRate() methods.
     * @param offRate (Optional) Time (in milliseconds) the display must stay off, the value must be in the range minBlinkRate <= offRate <= maxBlinkRate. Those preset values might be known by the use of the getMinBlinkRate() and the getMaxBlinkRate() methods. If no offRate value is provided the method will assume it's a symmetric blink call and use a value for offRate equal to the value passed for onRate.
     *
     * @retval true: If the display was not already set to blink (so now the blinking starts).
     * @retval false: The display was already set to blink, and/or one or more of the parameters passed was out of range. The blinking won't be started.
     */
    bool blink(const unsigned long &onRate, const unsigned long &offRate = 0);
    /**
     * @brief Clears the display, turning off all the segments and dots.
     *
     * @note The clearing process involves writing a **space** character to every display port. Due to physical display characteristics this may or may not be equal to writing a '\0' to them.
     *
     */
    void clear();
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of **two** segmented values or tasks.
     *
     *  The display gives a general fast notion on the matter, as a battery charge level, liquids deposit level, time remaining, tasks completeness and so on. The levels are represented by the horizontal segments (0, 1, 2 or 3 from bottom to top), and a character that might be added before each of the graphical representations to give an indication of what the display is showing. As four digit ports must be used, this method only applies to displays with 4 or more digits, the display is splitted in two sectors, the left side and the right side, and each one of them must have a valid value (0 <= value <= 3) to enable them to be displayed, and might have (or not) a single displayable character to give a visual hint to what the value is showing. For more information check the gauge(const int, char) method.
     *
     * @param levelLeft The value to display for the two left side 7 segments display ports, must be in the range 0 <= level <= 3.
     * @param levelRight The value to display for the two right side 7 segments display ports, must be in the range 0 <= level <= 3.
     * @param labelLeft (Optional) A char, if not specified the default value, a space, will be assumed, that will be displayed in the leftmost digit of the display. The character must be one of the "displayable" characters, as listed in the **print()** method description.
     * @param labelRight A char, optional parameter (if not specified the default value, a Space, will be assumed), that will be displayed in the position left to the **levelRight** display, just before the levelRight value. The character must be one of the "displayable" characters, as listed in the print(std::string) method description.
     *
     * @retval true: The values could be represented.
     * @retval false: The values couldn't be represented, being that the **levelLeft** and/or **levelRight** parameter was out of range and/or the **labelLeft** and/or **labelRight** parameter was not in the list of displayable characters. The display will be blanked.
     *
     */
    bool doubleGauge(const int &levelLeft, const int &levelRight, char labelLeft = ' ', char labelRight = ' ');
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of a segmented value or task.
     *
     * The display gives a general fast notion on the matter, as a battery charge level, liquids deposit level, time remaining, tasks completeness and so on. The levels are represented by the horizontal segments (0, 1, 2 or 3 from bottom to top, and from left to right), and a character might be added before -leftmost port- the graphical representation to give an indication of what the display is showing. This method is usable in displays which have from 4 digits and up, as the representation makes use of 4 digits.
     *
     * @param level The integer value to display, must be in the range 0 <= level <= 3.
     * @param label (Optional) A character that might be added before (leftmost port) the graphical representation to give an indication of what the display is showing, if not specified the default value, a space, will be assumed. The character must be one of the "displayable" characters, as listed in the print(std::string) method description.
     *
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, being that the **level** parameter was out of range and/or the **label** parameter was not in the list of displayable characters. The display will be blanked.
     *
     */
    bool gauge(const int &level, char label = ' ');
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of a segmented value or task.
     *
     * See gauge(const int, char) for details
     *
     * @param level The double value to display, must be in the range 0.0 <= level <= 1.0, being the range the representation of the percentage of the 'full' level, so that the ranges are:
	  * 0.0 <= level < 0.25 for the first level,
	  * 0.25 <= level < 0.50 for the second level,
	  * 0.50 <= level < 0.75 for the third level, and
	  * 0.75 <= level <= 1.00 for the fourth and upper level.
     * @param label (Optional) A character that might be added before (leftmost port) the graphical representation to give an indication of what the display is showing, if not specified the default value, a space, will be assumed. The character must be one of the "displayable" characters, as listed in the print(std::string) method description.
     *
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, being that the **level** parameter was out of range and/or the **label** parameter was not in the list of displayable characters. The display will be blanked.
     *
     */
    bool gauge(const double &level, char label = ' ');
    /**
     * @brief Gets quantity of digits, or ports, of the display.
     *
     * The quantity of digits -ports- the display have available. The object instantiation requires a **physical display object** as parameter, and such information is requested from that object. Each time this class is instantiated the object is created with the needed resources -display memory buffer, auxiliary buffers, etc.), and the range of values displayable are calculated based on the display's ports quantity parameter, and that value is the one returned by this method.
     *
     * @return The number indicating the quantity of digits of the instantiated display.
     */
    uint8_t getDigitsQty();
    /**
     * @brief Gets the greatest integer number value displayable by the display.
     *
     * The value is calculated according to the quantity of digits -ports- the display has as retrieved from the underlying hardware at the object instantiation.
     *
     * @return The greatest integer value display capability.
     *
     */
    int32_t getDspValMax();
    /**
     * @brief Gets the minimum integer number value displayable by the display.
     *
     * The value is calculated according to the quantity of digits -ports- the display has as retrieved from the underlying hardware at the object instantiation.
     *
     * @return The smallest integer value display capability.
     *
     * @note The use of one port to represent the **-** (minus) sign is considered in the value calculation.
     *
     */
    int32_t getDspValMin();
    /**
     * @brief Gets the instantiation number it was given to the object.
     *
     * Each time the class is instantiated the created object receives a serial instantiation number that can be used in order to easily identify each object in case of need.
     *
     * @return The instantiation serial number of the object.
     */
    uint16_t getInstanceNbr();
    /**
     * @brief Gets the maximum value the blink rates for the blink() and blink(const unsigned long, const unsigned long) might take.
     *
     * The speed at witch the physical displays might be turned on and off are limited. In the case of this parameter a too much high value might avoid the blinking strobe effect of being perceived, giving the sensation that the display is fixed on, or was cleared from values. So a higher limit is imposed.
     *
     * @return The maximum value that might be used as a blink() function parameter.
     */
    unsigned long getMaxBlinkRate();
    /**
     * @brief Gets the minimum values the blink rates for the blink() and blink(const unsigned long, const unsigned long) might take.
     *
     * The speed at witch the physical displays might be turned on and off are limited. In the case of this parameter a too much low value might avoid the blinking strobe effect of being perceived, or be not toleated by the underlying hardware, giving the sensation that the display is fixed on, or was cleared from values. So a lower limit is imposed.
     *
     * @return The minimum value that might be used as a blink() function parameter.
     */
    unsigned long getMinBlinkRate();
    /**
     * @brief Returns a value indicating if the display is blank
     *
     * @retval true: all the display ports hold a **space** value.
     * @retval false: at least one of the display ports hold a value different to **space** value.
     *
     * @note The condition to be blank is that all the display ports are exhibiting the _space character, not to be confused with '\0'
    */
    bool isBlank();
    /**
     * @brief Gets if the display is in **blinking mode**.
     *
     * @retval true: The display is set to blink.
     * @retval false: The display is set not to blink.
     *
     */
    bool isBlinking();
    /**
     * @brief Gets if the display is in **waiting mode**.
     *
     * @retval true: The display is set in waiting mode.
     * @retval false: The display is not set in waiting mode.
     *
     * @note Any **print()** method invoked stops a running waiting mode.
     *
     */
    bool isWaiting();
    /**
     * @brief Stops the display blinking, if it was doing so, leaving the display turned on.
     *
     * @retval true: The display was set to blink, and the blinking is stopped.
     * @retval false: The display was not set to blink, no changes have been done.
     *
     */
    bool noBlink();
    /**
     * @brief Stops the **waiting mode** in process.
     *
     * @retval true: The display was set to wait, and the waiting is stopped.
     * @retval false: The display was not set to wait, no changes will be done.
     *
     */
    bool noWait();
    /**
     * @brief Displays a string of text.
     *
     * Displays the string text if it contains all **displayable** characters, which are the ones included in the following list: **0123456789AabCcdEeFGHhIiJLlnOoPqrStUuY-_.** and the **space**.
     * There are other 3 characters that can be represented in the display, but the conversion from a character to use while programming is "host language setting dependent", so those where assigned to available ASCII non displayable characters of easy access in any keyboard layout in most languages, they can be used as part of the text string to display, and they are:
     *
     * = Builds a character formed by lighting the lower 2 horizontal segments of the digit display, can be described as a "lower equal" symbol.
     *
     * ~ Builds a character formed by lighting the 3 horizontal segments of the digit display, can be described as an "equivalent" symbol.
     *
     * _*_ (asterisk) Builds a character by lighting the upper 4 segments, forming a little square, can be described as the "degrees" symbol or º.
     *
     * @param text String, up to **DigitsQty** -see getDigitsQty()- displayable characters long PLUS usable dots, all characters included in the representable characters list. Each valid character might be followed by a "." if needed, without being counted as a character, even spaces and special chars. If two or more consecutive dots are passed, an intermediate space is considered to be included between each pair of them, and that space counts as one of the available characters to display.
     *
     * @retval true: The text could be represented.
     * @retval false: The text couldn't be represented, and the display will be blanked.
     *
     * @note Several reasons might be causing a string to not display, including:
     * - The inclusion of a character not part of the **displayable list**.
     * - The text is longer than the object's DigitsQty (dots are not included in the count).
     * - The use of two or more consecutive "." -dots- which implies the addition of a space between them not taken into the account of the text lenght.
     *
     */
    bool print(std::string text);
    bool print(const int32_t &value, bool rgtAlgn = false, bool zeroPad = false);
    bool print(const double &value, const unsigned int &decPlaces, bool rgtAlgn = false, bool zeroPad = false);
    void resetBlinkMask();
    void setBlinkMask(const bool* newBlnkMsk);
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    bool setWaitChar (const char &newChar);
    bool setWaitRate(const unsigned long &newWaitRate);
    bool wait();
    bool wait(const unsigned long &newWaitRate);
    bool write(const uint8_t &segments, const uint8_t &port);
    bool write(const std::string &character, const uint8_t &port);

};

//============================================================> Class declarations separator

class ClickCounter{
private:
    SevenSegDisplays _display;
    int _count{0};
    int _beginStartVal{0};
    bool _countRgthAlgn{true};
    bool _countZeroPad{false};
public:
    ClickCounter(uint8_t ccSclk, uint8_t ccRclk, uint8_t ccDio, bool rgthAlgn = true, bool zeroPad = false, bool commAnode = true, const uint8_t dspDigits = 4);
    ~ClickCounter();
    bool blink();
    bool blink(const unsigned long &onRate, const unsigned long &offRate = 0);
    void clear();
    bool countBegin(int32_t startVal = 0);  //To be analyzed it's current need
    bool countDown(int32_t qty = 1);
    bool countReset();
    bool countRestart(int32_t restartValue = 0);
    bool countStop();   //To be analyzed it's current need
    bool countToZero(int32_t qty = 1);
    bool countUp(int32_t qty = 1);
    int32_t getCount();
    int32_t getStartVal();
    bool noBlink();
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    bool updDisplay();  //To be analyzed it's current need
};

//============================================================> Class declarations separator



#endif /* _SEVENSEGDISPLAYS_STM32_H_ */
